Templates/GetVersions.xml

<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
		        xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
			xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
			xmlns:drm="http://drm.webservices.epm.oracle"
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
  <soap:Header>
    <drm:AppParameters xmlns="http://drm.webservices.epm.oracle">
      <drm:serverUrl >HOST</drm:serverUrl>
      <drm:sessionParams >ProductVersion=11.1.2,CultureName=en-US,TimeZoneOffset=-360</drm:sessionParams>
    </drm:AppParameters>
        <wsse:Security soap:mustunderstand="1" >
      <wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" 
                                wsu:Id="wss_saml_or_username_token_service_policy ">
        <wsse:Username>USER</wsse:Username>
	<wsse:Password>PASSWORD</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
  </soap:Header>
   <soap:Body>
   
 <drm:getVersions>	 
      </drm:getVersions>

   </soap:Body>
</soap:Envelope>
